---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLevelInfo.GetBuildingStorey
source: html/8289ff4f-ece6-6a1c-787c-6c1fd670dc8f.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.GetBuildingStorey Method

Gets the IfcBuildingStorey handle.

## Syntax (C#)
```csharp
public IFCAnyHandle GetBuildingStorey()
```

## Returns
The handle.